{
    "title": "kulvians",
    "subtitle": "a dedicated translating community.",
    "about": "About Us",
    "contributions": "Contributions",
    "guides": "Guides",
    "contact": "Contact us!",
    "status": "Status - ",
    "done": "DONE",
    "typegame": "Type - Game",
    "devs": "Developers - ",
    "trans": "Translators - ",
    "desc": "Description: ",
    "rhythm_desc": "Rhythm Quest is an ambitious reinvention of the classic platformer, focusing on attacking, jumping and moving to… well, a rhythm!<br><br>It’s a very unique take on something we’ve all probably tried before, so if you want to see for yourself, you can check out the game and its demo <a href='https://rhythmquestgame.com/' class='text-yellow-300 hover:underline' target='_blank'>here</a>. The developer is very active and friendly, so make sure to support them if you enjoy the game.<br><br>The translation, which you can contribute to or add your own, is found <a href='https://crowdin.com/project/rhythm-quest' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "battlebit_desc": "BattleBit Remastered is a massively multiplayer online first-person shooter, most known for allowing up to 254 players to compete in player versus player matches on large maps. The game is strongly inspired by the Battlefield series.<br><br>We picked this for our first translation project due to our love of games like this. Plus, it’s only developed by three people! You can check out the game <a href='https://store.steampowered.com/app/671860/BattleBit_Remastered/' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "melonracer_desc": "This is a fun classic gamemode for Garry’s Mod, now in Lithuanian! You can make your own translation or find ours <a href='https://crowdin.com/project/melonracer' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "typeapp": "Type - Application",
    "resume_desc": "As described by the developer, “Reactive Resume is a free and open-source resume builder that simplifies the process of creating, updating, and sharing resumes.”<br><br>So not only is it open-source, but it also quickens arguably the most boring part about applying for a job! You can find, use and support the tool <a href='https://rxresu.me/' class='text-yellow-300 hover:underline' target='_blank'>here</a>. Make sure to give it a try!<br><br>If you want to contribute to our translation or add your own, you can find the translation project <a href='https://crowdin.com/project/reactive-resume' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "bitwarden_desc": "<span class='italic font-semibold'>Note: We are NOT the only ones contributing to this translation. You can find all the contributors <a href='https://crowdin.com/project/bitwarden-desktop/lt' class='text-yellow-300 hover:underline' target='_blank'>here</a>.<br><br></span> <a href='https://bitwarden.com/' class='text-yellow-300 hover:underline' target='_blank'>Bitwarden</a> is a free open-source password management application, available on browser, desktop, and mobile phones.<br><br> We decided to contribute to this translation due to the quality and care the application is made with. Plus, it’s open source and free! What else could you ask for?",
    "authext_desc": "This is a handy Firefox extension for generating two-factor authentication (2FA) codes in your browser. It supports TOTP, HOTP, and even Steam Guard!<br><br> And to make things even better, it’s open-source. You can find both the extension and it’s source code <a href='https://authenticator.cc/' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    
    "about_who": "Who are we?",
    "about_p": "We are a relatively small community of tech enthusiasts and translators from Lithuania who wish to preserve our language. Our idea of free translation was inspired by the <a href='https://en.wikipedia.org/wiki/Free_and_open-source_software' class='text-yellow-300 hover:underline' target='_blank'> FOSS movement</a>. Since software can be open-source, we decided to bring that same idea to another aspect of every program – localization.",
    "about_why": "Why 'Kulvians'?",
    "about_abraomas": "Abraomas Kulvietis was one of the fathers of Lithuanian writing and translation. He was a protestant born in the XVI century, responsible for creating various Lithuanian schools and spreading ideas of reformation. His most renowned work is creating one of the first Lithuanian psalms. At the time, the Grand Duchy of Lithuania had a very undeveloped written language, which is why the work of Abraomas is considered very important to this day.",
    "about_abraomas_late": "He was exiled to Prussia for his religious views later on in life, where he became the rector of Karaliaučius University and the Duke of Prussia’s advisor. Before his death he was allowed to return to Lithuania, where he continued the spread of his national and protestant ideas. He passed away in 1545 from consumption at 35 years of age.",
    "about_abraomas_final": "Because of his importance in Lithuanian culture and our hope of continuing his ideals, we decided to name ourselves after his last name.",

    "contributions_title": "Our contributions",
    "contributions_games":"Games",
    "contributions_software":"Software",

    "404_title": "The page you're looking for wasn't found!",
    "404_p": "Click <a href='/' class='nav__link text-yellow-300 hover:underline' data-link>here</a> to go back.</p>",

    "index_welcome": "Welcome!",
    "index_p": "We are a Lithuanian translating community that’s dedicated to ensuring as many people as possible can enjoy software and media in their own language, and all for free.<br><br> We don’t charge anything for our translations, and we are able to translate from English to Lithuanian and vice versa. Want your software, website, or game to be more available, for free? Contact us!<br><br> If you’re curious about translation or other topics, you can check our compiled experience in the “Guides” section.",

    "crowdin_title": "Crowdin - setup guide",
    "crowdin_subtitle": "Translation using crowdin.com",
    "crowdin_intro": "Crowdin is one of the most popular localization management tools out there, and for good reason! It allows practically anyone, regardless of their experience, to contribute to and review translations. It doesn’t require any programming or IT knowledge, just an internet connection and compatible browser. Let’s get started!<br><br> Requirements:",
    "crowdin_requirements": "<li>Internet connection</li> <li>Web browser (Chrome, Firefox, etc.)</li>",
    "crowdin_start": "<br>To start with, go to <a href='https://crowdin.com/' class='text-yellow-300 hover:underline' target='_blank'>crowdin.com</a>. This is where we’ll register. Click 'Sign up'",
    "crowdin_2nd": "<br>Sign up using the method you prefer the most. You can either create a separate account, or register using something like Google or GitHub.",
    "crowdin_3rd": "<br>Once successfully registered, you’ll be redirected to your new profile (make sure to verify your account to ensure better security). Now, navigate to Profile -> Explore Public Projects.",
    "crowdin_4th": "You’ll be shown a variety of public projects available for translation. You can either search for a specific one, or browse using categories. For demo purposes, we’ll be searching for “Bitwarden”.",
    "crowdin_5th": "<br>And we get shown the results. If you can’t find what you’re looking for, you can try using the filters located to the right to narrow down your search. Select the project you’d like to translate.",
    "crowdin_6th": "<br>Note: It’s also possible that the project you’re looking for is private. To access such projects, you should contact the people responsible for said project’s localization.",
    "crowdin_7th": "<br>Select the language you’d like to contribute to. If it doesn’t exist, contact the localization managers located below the app’s description.",
    "crowdin_8th": "<br>Now you’ll be shown all of the localization files included in the project, together with how much they’ve been translated. You can either choose a specific file, or click “Translate All”.",
    "crowdin_9th": "<br>This opens the editor. It may appear overwhelming at first, but you’ll get used to it!",
    "crowdin_10th": "<br>Above, you can see the original text, and below is the field where you type in your translation. Below it, you can see TM and MT (Machine Translation) suggestions, which can help you get a rough idea of what the translation might be. To the right are comments, which are usually left by other translators. To the left is a list of strings (sentences or words) that need to be translated.",
    "crowdin_11th": "<br>Note: Sometimes, there are also contexts given for some words. They can get you a better idea of what the word actually means. You can view them by hovering over them. They are underlined like this:",
    "crowdin_12th": "<br>That covers the basics! Crowdin is an extremely powerful and easy platform to use, and this guide only scratches the surface. If you’d like to learn more, refer to the official <a href='https://support.crowdin.com/crowdin-intro/' class='text-yellow-300 hover:underline' target='_blank'>Crowdin documentation</a>. It might contain the details you need!<br><br>"
}
