{
    "title": "kulvians",
    "subtitle": "a dedicated technology and translation community.",
    "about": "About Us",
    "contributions": "Contributions",
    "guides": "Guides",
    "contact": "Contact us!",
    "status": "Status - ",
    "done": "DONE",
    "typegame": "Type - Game",
    "devs": "Developers - ",
    "trans": "Translators - ",
    "desc": "Description: ",
    "rhythm_desc": "Rhythm Quest is an ambitious reinvention of the classic platformer, focusing on attacking, jumping and moving to… well, a rhythm!<br><br>It’s a very unique take on something we’ve all probably tried before, so if you want to see for yourself, you can check out the game and its demo <a href='https://rhythmquestgame.com/' class='text-yellow-300 hover:underline' target='_blank'>here</a>. The developer is very active and friendly, so make sure to support them if you enjoy the game.<br><br>The translation, which you can contribute to or add your own, is found <a href='https://crowdin.com/project/rhythm-quest' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "battlebit_desc": "BattleBit Remastered is a massively multiplayer online first-person shooter, most known for allowing up to 254 players to compete in player versus player matches on large maps. The game is strongly inspired by the Battlefield series.<br><br>We picked this for our first translation project due to our love of games like this. Plus, it’s only developed by three people! You can check out the game <a href='https://store.steampowered.com/app/671860/BattleBit_Remastered/' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "melonracer_desc": "This is a fun classic gamemode for Garry’s Mod, now in Lithuanian! You can make your own translation or find ours <a href='https://crowdin.com/project/melonracer' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "typeapp": "Type - Application",
    "resume_desc": "As described by the developer, “Reactive Resume is a free and open-source resume builder that simplifies the process of creating, updating, and sharing resumes.”<br><br>So not only is it open-source, but it also quickens arguably the most boring part about applying for a job! You can find, use and support the tool <a href='https://rxresu.me/' class='text-yellow-300 hover:underline' target='_blank'>here</a>. Make sure to give it a try!<br><br>If you want to contribute to our translation or add your own, you can find the translation project <a href='https://crowdin.com/project/reactive-resume' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "bitwarden_desc": "<span class='italic font-semibold'>Note: We are NOT the only ones contributing to this translation. You can find all the contributors <a href='https://crowdin.com/project/bitwarden-desktop/lt' class='text-yellow-300 hover:underline' target='_blank'>here</a>.<br><br></span> <a href='https://bitwarden.com/' class='text-yellow-300 hover:underline' target='_blank'>Bitwarden</a> is a free open-source password management application, available on browser, desktop, and mobile phones.<br><br> We decided to contribute to this translation due to the quality and care the application is made with. Plus, it’s open source and free! What else could you ask for?",
    "authext_desc": "This is a handy Firefox extension for generating two-factor authentication (2FA) codes in your browser. It supports TOTP, HOTP, and even Steam Guard!<br><br> And to make things even better, it’s open-source. You can find both the extension and it’s source code <a href='https://authenticator.cc/' class='text-yellow-300 hover:underline' target='_blank'>here</a>.",
    "jelu_desc":"Jelu is an open-source, self-hosted reading tracker! Ever wanted to have a place where to track your reading? Then this app might be for you! It's extensive documentation and installation guide can be found <a href='https://bayang.github.io/jelu-web/' class='text-yellow-300 hover:underline'target='_blank'>here</a>.<br><br>If you want to contribute to our translation or add your own, you can find the translation project <a href='https://crowdin.com/project/jelu' class='text-yellow-300 hover:underline'target='_blank'>here</a>.",

    "about_who": "Who are we?",
    "about_p": "We are a relatively small community of tech enthusiasts and translators from Lithuania who wish to preserve our language. Our idea of free translation was inspired by the <a href='https://en.wikipedia.org/wiki/Free_and_open-source_software' class='text-yellow-300 hover:underline' target='_blank'> FOSS movement</a>. Since software can be open-source, we decided to bring that same idea to another aspect of every program – localization.",
    "about_why": "Why 'Kulvians'?",
    "about_abraomas": "Abraomas Kulvietis was one of the fathers of Lithuanian writing and translation. He was a protestant born in the XVI century, responsible for creating various Lithuanian schools and spreading ideas of reformation. His most renowned work is creating one of the first Lithuanian psalms. At the time, the Grand Duchy of Lithuania had a very undeveloped written language, which is why the work of Abraomas is considered very important to this day.",
    "about_abraomas_late": "He was exiled to Prussia for his religious views later on in life, where he became the rector of Karaliaučius University and the Duke of Prussia’s advisor. Before his death he was allowed to return to Lithuania, where he continued the spread of his national and protestant ideas. He passed away in 1545 from consumption at 35 years of age.",
    "about_abraomas_final": "Because of his importance in Lithuanian culture and our hope of continuing his ideals, we decided to name ourselves after his last name.",

    "contributions_title": "Our contributions",
    "contributions_games":"Games",
    "contributions_software":"Software",

    "404_title": "The page you're looking for wasn't found!",
    "404_p": "Click <a href='/' class='nav__link text-yellow-300 hover:underline' data-link>here</a> to go back.</p>",

    "index_welcome": "Welcome!",
    "index_p": "We are a Lithuanian translating community that’s dedicated to ensuring as many people as possible can enjoy software and media in their own language, and all for free.<br><br> We don’t charge anything for our translations, and we are able to translate from English to Lithuanian and vice versa. Want your software, website, or game to be more available, for free? Contact us!<br><br> If you’re curious about translation or technology, you can check our compiled experience in the “Guides” section.",

    "crowdin_title": "Crowdin - setup guide",
    "crowdin_subtitle": "Translation using crowdin.com",
    "crowdin_intro": "Author: nitrog<br><br>Crowdin is one of the most popular localization management tools out there, and for good reason! It allows practically anyone, regardless of their experience, to contribute to and review translations. It doesn’t require any programming or IT knowledge, just an internet connection and compatible browser. Let’s get started!<br><br> Requirements:",
    "crowdin_requirements": "<li>Internet connection</li> <li>Web browser (Chrome, Firefox, etc.)</li>",
    "crowdin_start": "<br>To start with, go to <a href='https://crowdin.com/' class='text-yellow-300 hover:underline' target='_blank'>crowdin.com</a>. This is where we’ll register. Click 'Sign up'",
    "crowdin_2nd": "<br>Sign up using the method you prefer the most. You can either create a separate account, or register using something like Google or GitHub.",
    "crowdin_3rd": "<br>Once successfully registered, you’ll be redirected to your new profile (make sure to verify your account to ensure better security). Now, navigate to Profile -> Explore Public Projects.",
    "crowdin_4th": "You’ll be shown a variety of public projects available for translation. You can either search for a specific one, or browse using categories. For demo purposes, we’ll be searching for “Bitwarden”.",
    "crowdin_5th": "<br>And we get shown the results. If you can’t find what you’re looking for, you can try using the filters located to the right to narrow down your search. Select the project you’d like to translate.",
    "crowdin_6th": "<br>Note: It’s also possible that the project you’re looking for is private. To access such projects, you should contact the people responsible for said project’s localization.",
    "crowdin_7th": "<br>Select the language you’d like to contribute to. If it doesn’t exist, contact the localization managers located below the app’s description.",
    "crowdin_8th": "<br>Now you’ll be shown all of the localization files included in the project, together with how much they’ve been translated. You can either choose a specific file, or click “Translate All”.",
    "crowdin_9th": "<br>This opens the editor. It may appear overwhelming at first, but you’ll get used to it!",
    "crowdin_10th": "<br>Above, you can see the original text, and below is the field where you type in your translation. Below it, you can see TM and MT (Machine Translation) suggestions, which can help you get a rough idea of what the translation might be. To the right are comments, which are usually left by other translators. To the left is a list of strings (sentences or words) that need to be translated.",
    "crowdin_11th": "<br>Note: Sometimes, there are also contexts given for some words. They can get you a better idea of what the word actually means. You can view them by hovering over them. They are underlined like this:",
    "crowdin_12th": "<br>That covers the basics! Crowdin is an extremely powerful and easy platform to use, and this guide only scratches the surface. If you’d like to learn more, refer to the official <a href='https://support.crowdin.com/crowdin-intro/' class='text-yellow-300 hover:underline' target='_blank'>Crowdin documentation</a>. It might contain the details you need!<br><br>",

    "htb_htblabs_title": "HTB - HTBank Guide - Parameter Injection",
    "htb_htblabs_subtitle": "A guide to the 'HTBank (Easy)' challenge",
    "htb_htblabs_intro": "Author: nitrog<br><br>'HTBank' is an Easy marked challenge from HackTheBox. It is attributed to the 'Web' category. It involves having to discover a specific parameter, and then changing it using an attack referred to as 'Parameter Pollution'. Let's get started!<br><br> Requirements:",
    "htb_htblabs_requirements": "<li>Internet connection</li> <li>Burp Suite Community Edition</li> <li>A HackTheBox account with access to the lab</li>",
    "htb_htblabs_start": "First, we'll need to open up the link provided in Burp Suite. Open up the Proxy and turn off the interceptor so we could explore the site. Then we'll open up the browser:",
    "htb_htblabs_2nd": "We're presented with a login/register form. After trying to perform basic SQL injection in the login page, we can see that it doesn't take us anywhere. Let's just try registering for now.",
    "htb_htblabs_3rd": "We've registered! Now let's login using the same credentials.",
    "htb_htblabs_4th": "We're presented with a dashboard of sorts. Clicking 'Add Money' doesn't do anything. However, 'Withdraw Money' looks a lot more promising:",
    "htb_htblabs_5th": "Let's enter an arbitrary amount of numbers in each field, <b>turn on the intercept</b>, and then click 'Withdraw' to see what happens.",
    "htb_htblabs_6th": "We can see that the request has been captured. However, to do anything with it, we'll need to send it to Repeater (CTRL+R or Right Click -> Send to Repeater).",
    "htb_htblabs_7th": "Let's send the request. We'll see that whatever number we enter, even the one given to us as a clue in the description (1337), we still get the same result. Inputting text also doesn't get us any useful results.",
    "htb_htblabs_8th": "How about we instead inspect the zipped source code. After a bit of digging, we can find the configuration information for the database.",
    "htb_htblabs_9th": "This would normally be useful, however, for this instance, it is pretty much irrelevant. Let's continue on. 'WithdrawController.php' looks particularly interesting:",
    "htb_htblabs_10th": "After inspection, it seems that if the amount entered when withdrawing is equal to 1337, the show_flag parameter is changed in the database. This is very useful.",
    "htb_htblabs_11th": "But wait. Didn't we do that before and it returned the same result as with any <i>other</i> number? There must be something blocking us from doing this. Let's inspect 'routes.py':",
    "htb_htblabs_12th": "In the 'withdraw' function's 'try' block, we can see that there's an 'if' statement. It checks the users balance, and if it is below zero, it returns an error saying there's not enough credits. This applies to us, since we just created our account and our balance is empty.",
    "htb_htblabs_13th": "So this is the thing holding us back. If our balance wasn't 0, the request after would follow and our flag would presumably be displayed in the home page, as can be seen in the same file in a previous function:",
    "htb_htblabs_14th": "This is where parameter pollution comes in. By submitting the 'amount' parameter twice in the same request, first as 0, and then as 1337, we bypass the balance check, and the request containing the flag will be shown to us in the home page. Let's go back to Burp's Repeater:",
    "htb_htblabs_15th": "Let's copy the 'amount' parameter, change the first one to zero, and the second one to '1337'. And now we get this response:",
    "htb_htblabs_16th": "<i>Note: If you don't get this response, try first sending 1337 as the first 'amount' value, and <b>only then</b> change it to zero.</i>",
    "htb_htblabs_17th": "If we go back to the home page, the flag will be now displayed. Congratulations!",
    "htb_htblabs_18th": "If you want to read up on parameter pollution more, you can do so on <a href='https://portswigger.net/web-security/api-testing/server-side-parameter-pollution' class='text-yellow-300 hover:underline' target='_blank'>this excellently written PortSwigger article</a>.<br><br>",

    "htb_0xchunked_title": "HTB - 0xBOverchunked Guide",
    "htb_0xchunked_subtitle": "A guide to the '0xBOverchunked (Easy)' challenge",
    "htb_0xchunked_intro": "Author: nitrog<br><br>0xBOverchunked is an 'Easy' rated HTB challenge, related to web application exploitation.<br><br> Requirements:",
    "htb_0xchunked_requirements": "<li>Internet connection</li> <li>Burp Suite Community Edition</li> <li>SQLMap</li> <li>A HackTheBox account with access to the lab</li>",
    "htb_0xchunked_start": "First, we'll need to open up the link provided in Burp Suite. Open up the Proxy and turn off the intercept so we could explore the site. Then we'll open up the browser:",
    "htb_0xchunked_2nd": "In this task, we need to find the sixth value being saved in the database. Let's try searching with the presented input field:",
    "htb_0xchunked_3rd": "It seems like we're not allowed to view the sixth entry. Let's try to perform basic SQL injection.",
    "htb_0xchunked_4th": "We can see that there's a WAF (Web Application Firewall) present, and it's blocking us from doing the injection. There's probably a programatic filter that checks for suspicious characters. Let's inspect the source code:",
    "htb_0xchunked_5th": "Seems like our suspicious were correct, as in the 'waf.php' file we can see the filter in place. Looks like we'll have to think of some other way to get the flag. Let's continue with the source code analysis.",
    "htb_0xchunked_6th": "In the 'cursor.php' of the 'Database' folder, we can find both the code preventing us from viewing the sixth entry, and a clue. We can see that there are two possible types of database queries: 'safequery' and 'unsafequery'. Let's try to find how to trigger this unsafe query.",
    "htb_0xchunked_7th": "Exploring the 'SearchHandler.php' file, we can see that if the HTTP transfer is chunked, the unsafe query is triggered, which will allow us to search for the sixth entry.",
    "htb_0xchunked_8th": "According to the <a href='https://developer.mozilla.org/en-US/docs/Web/HTTP/Range_requests#comparison_to_chunked_transfer-encoding' class='text-yellow-300 hover:underline' target='_blank'>Mozilla web documentation</a>, chunked transfer encoding is often used when larger amounts of data are sent to a client, without buffering the response or determining the exact length. This leads to better latency. Examples of it's use consist of large database queries (to fill an HTML table, for example) or when transmitting large images.",
    "htb_0xchunked_9th": "In the cybersecurity context, chunked requests can be used to bypass certain SQL injection restrictions. It can split the usually blacklisted SQL keywords between chunks, which can make the request containing them be accepted. For example, the 'SQLMap' tool contains a tamper script utilizing this technique, using the '--chunked' parameter.",
    "htb_0xchunked_10th": "However, since there aren't any variables being submitted through the URL, we'll need to capture the actual request. For this, turn on the intercept in Burp and submit the search form. You should see the request appear in your Burp Proxy:",
    "htb_0xchunked_11th": "Now copy everything, create a text file, and paste the request there. Make sure to save the file, and remember where it is.",
    "htb_0xchunked_12th": "Now let's pass the request to SQLMap, using these parameters:",
    "htb_0xchunked_13th": "This is what each argument does:<br><br><li>-r - provides the location to the captured request, which SQLMap will use to execute the payload.</li> <li>--chunked - instructs SQLMap to use chunked encoding, which we discussed earlier.</li> <li>--dump - dumps the database table entries.</li> <li>--time-sec=2 - this parameter instructs SQLMap to wait up to 2 seconds for a response. The default is 5, so this speeds up the process.</li> <li>--threads - this parameter instructs SQLMap to use a specific amount of CPU threads. This speeds up the injection process, and allows to retrieve results quicker. The amount of threads you can use depends on your system.</li>",
    "htb_0xchunked_14th": "If you're prompted with any decisions, go with the default. After a while, you should see the flag:",
    "htb_0xchunked_15th": "Congratulations, you finished the lab!<br><br>",

    "htb_nmap_title": "HTB - Network Enumeration with Nmap Guide",
    "htb_nmap_subtitle": "A guide to the HTB 'Network Enumeration with Nmap' Labs",
    "htb_nmap_intro": "Author: nitrog<br><br>This excellent HTB module features labs of three difficulties - Easy, Medium and Hard. They are focused on Firewall/IDS evasion using nmap.<br><br> Requirements:",
    "htb_nmap_requirements": "<li>Internet connection (duh)</li> <li>Nmap</li> <li>A HackTheBox account with access to the module</li>",
    "htb_nmap_start": "Let's start with the first lab. The IDS seems to be very rudimentary and we are only required to get the OS (note: NOT the version of the OS). There are a few things to mention first, notably, the types of TCP scans we'll be running:",
    "htb_nmap_2nd": "<li>-sS (SYN scan)</li> <li>-sT (Connect scan)</li> <li>-sA (ACK scan)</li>",
    "htb_nmap_3rd": "SYN scans in nmap are run by default if you are running the command as root (or with sudo). During a SYN scan, we send a SYN packet to the server, and get returned a two packets: SYN and ACK. Once received, nmap tears down the connection and moves on to the next port.",
    "htb_nmap_4th": "<b>Strengths:</b><br><br> <li>SYN scans are fast, since we do not actually establish a full connection to the server.</li> <li>SYN scans in general are considered more stealthy, however not always.</li>",
    "htb_nmap_5th": "<b>Weaknesses:</b><br><br> <li>SYN scans require sudo privileges, because a SYN scan requires raw socket access.</li> <li>SYN scans, while, as mentioned, are considered more stealthy, they're sometimes more prone to being detected by IDS/IPS systems, or network admins (For example, what's more suspicious when monitoring network traffic - a connection that gets destroyed mid-way through being established, or one of many hundreds or thousands of TCP/IP connections?).</li>",
    "htb_nmap_6th": "Let's move on to Connect scans. These are far simpler - they establish a full TCP connection. A SYN packet is sent, SYN+ACK is received, and then the ACK packet is returned to the server, establishing a TCP connection. Only then is it stopped.",
    "htb_nmap_7th": "<b>Strengths:</b><br><br> <li>Connect scans require no privileges.</li> <li>Can be more stealthy, depending on monitoring activity.</li> <li>Simpler.</li>",
    "htb_nmap_8th": "<b>Weaknesses:</b><br><br> <li>Slower, since a full TCP connection gets established. Can be mediated by increasing timing(-T) or the minimum rate(--min-rate).</li> <li>Generally 'louder' and more noticeable, especially on less active networks.</li>",
    "htb_nmap_9th": "Finally, we have ACK scans. Instead of sending a SYN packet as with the two previous scan types, an ACK packet is sent to the server. The server then responds by sending an RST packet (which closes the connection). With these scans, it is usually more difficult to determine whether the connection was first established from inside or outside the network, making them harder to detect by firewalls. Because of this, while with a SYN or Connect scan, a port may be designated as filtered, with an ACK scan, it might be shown as unfiltered.",
    "htb_nmap_10th": "<b>Strengths:</b><br><br> <li>Good for checking which ports are filtered.</li> <li>Usually bypasses simple filters or firewall configurations.</li>",
    "htb_nmap_11th": "<b>Weaknesses:</b><br><br> <li>Limited information - ACK scans do NOT show whether a port is closed or open, only if it is filtered.</li>",
    "htb_nmap_12th": "Now that we have the boring theory and basics out of the way - let's finally begin. Let's start with a basic SYN scan:",
    "htb_nmap_13th": "<b>Here are all the arguments explained:</b><br><br> <li>-sS - this specifies a SYN scan, which we just discussed.</li> <li>-sV - determines version of all found services.</li> <li>-sV -Pn - disables host discovery. (not necessary since we're only specifying one host, not a subnet)</li><li>-n - skip DNS resolution. Can increase scan speed.</li><li>--source-port - specifies the port from which to scan. We're using 53 here because it's the default port for DNS queries. This way, it can help mask our scans as legitimate DNS traffic.</li>",
    "htb_nmap_14th": "And we get the following result:",
    "htb_nmap_15th": "From the Apache and SSH version, we can gather that this is a Ubuntu system. We have our answer.",
    "htb_nmap_16th": "Now let's move to something more advanced. For the next lab, we need to get the version of the DNS server. We can do this by utilizing the following command:",
    "htb_nmap_17th": "<b>Here are all the arguments explained:</b><br><br> <li>-sT - this specifies a Connect scan. You can use a SYN scan, I'm just doing it to keep things different.</li> <li>-Pn - disables host discovery. (not necessary since we're only specifying one host, not a subnet)</li><li>-n - skip DNS resolution. Can increase scan speed.</li><li>--source-port - specifies the port from which to scan. This isn't used with Connect scans, so it doesn't need to be here.</li><li>-D RND:5 - specifies a decoy scan. Together with RND, it generates five random IP addresses, inserting our real IP between them. This helps disguise the origin of the sent packets.</li>",
    "htb_nmap_18th": "Using this, we get a list of ports:",
    "htb_nmap_19th": "Since we need the version of the DNS server, we're gonna need to investigate port 53, which appears filtered. Let's try only scanning the port (-p 53), and checking the version using -sV, while keeping the command identical to before (still doing a Connect scan).",
    "htb_nmap_20th": "We can find the flag in the VERSION tab of the scan result. And if you're curious, yes, we also get the result if we perform a SYN scan:",
    "htb_nmap_21st": "Let's move on to the last lab in this module. For this, we're gonna need to find out the version of some sort of new service that's appeared. Let's launch a general scan:",
    "htb_nmap_22nd": "<b>Here are all the arguments explained:</b><br><br> <li>-sS - this specifies a SYN scan.</li> <li>-Pn - disables host discovery. (not necessary since we're only specifying one host, not a subnet)</li><li>-n - skip DNS resolution. Can increase scan speed.</li><li>--source-port - specifies the port from which to scan.</li><li>-D RND:5 - specifies a decoy scan. Together with RND, it generates five random IP addresses, inserting our real IP between them. This helps disguise the origin of the sent packets.</li>",
    "htb_nmap_23rd": "We can see the new service - it being IBM's database manager over at port 50000. Let's launch a service version scan for this specific port:",
    "htb_nmap_24th": "We don't seem to be getting any results. If we try to switch scan type, we don't get anything better either. However, the port is deemed open. Let's instead try to connect using netcat, and see if we can grab the banner that way (don't forget sudo!):",
    "htb_nmap_25th": "And we get the flag. By the way, the only reason we weren't being filtered was because of an earlier command we used! Can you guess which?:",
    "htb_nmap_26th": "It was our source port. It seems disgusing ourselves as a DNS service allowed us to bypass certain filtering rules.",
    "htb_nmap_27th": "That concludes this guide. Nmap is a fantastic tool, and HTB is an equally fantastic place to learn more about it! Make sure to check both out if you're interested. Thanks for reading!"
}
