{
    "title": "kulviečiai",
    "subtitle": "savanorių vertėjų ir technologijos entuziastų bendruomenė.",
    "about": "Apie mus",
    "contributions": "Prisidėjimai",
    "guides": "Gidai",
    "contact": "Susisiekite!",
    "status": "Būsena - ",
    "done": "BAIGTA",
    "typegame": "Rūšis - Žaidimas",
    "devs": "Kūrėjai - ",
    "trans": "Vertėjai - ",
    "desc": "Aprašymas: ",
    "rhythm_desc": "Rhythm Quest - ambicingas klasikinis platformeris, kuriame daugiausia dėmesio skiriama puolimui, šokinėjimui ir judėjimui pagal... ritmą! Tai labai unikalus požiūris į kažką, ką tikriausiai visi jau esame bandę, todėl jei norite tai pamatyti patys, žaidimą ir jo demo versiją galite peržiūrėti <a href='https://rhythmquestgame.com/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Kūrėjas yra labai aktyvus ir draugiškas, todėl jei jums patiko žaidimas, būtinai jį palaikykite.<br><br> Vertimą, prie kurio galite prisidėti arba pridėti savo, rasite <a href='https://crowdin.com/project/rhythm-quest' class='text-yellow-300 hover:underline' target='_blank'> čia</a>.",
    "battlebit_desc": "BattleBit Remastered - masinė kelių žaidėjų internetinė pirmojo asmens šaudyklė, labiausiai žinoma dėl to, jog viename žemėlapyje gali vienu metu būti net iki 254 žmonių! Žaidimą labai įkvėpė Battlefield žaidimų serija. <br><br> Šį žaidimą pasirinkome savo pirmajam vertimo projektui dėl to, jog juose esame praleidę daugybę laiko ir tas akimirkas pamename iki šiol. Be to, jį sukūrė tik trys žmonės! Žaidimą galite peržiūrėti <a href='https://store.steampowered.com/app/671860/BattleBit_Remastered/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "melonracer_desc": "Tai smagus klasikinis Garry's Mod žaidimo režimas lietuvių kalba! Galite sukurti savo vertimą arba rasti mūsų <a href='https://crowdin.com/project/melonracer' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "typeapp": "Rūšis - Aplikacija",
    "resume_desc": "Kaip apibūdina kūrėjas, ''Reactive Resume yra nemokamas atvirojo kodo CV kūrėjas, kuris supaprastina CV kūrimo, atnaujinimo ir dalijimosi jais procesą.''<br><br>Taigi ši programa ne tik atvirojo kodo, bet ir pagreitina ko gero nuobodžiausią darbo paieškos dalį! Šį įrankį galite rasti, naudoti ir palaikyti <a href='https://rxresu.me/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Būtinai ją išbandykite!<br><br>Jei norite prisidėti prie mūsų vertimo arba pridėti savo, projektą galite rasti <a href='https://crowdin.com/project/reactive-resume' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "bitwarden_desc": "<span class='italic font-semibold'>Pastaba: mes NESAME vieninteliai kurie prisidėjo prie šio vertimo. Visus autorius galite rasti <a href='https://crowdin.com/project/bitwarden-desktop/lt' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.<br><br></span> <a href='https://bitwarden.com/' class='text-yellow-300 hover:underline' target='_blank'>Bitwarden</a> yra nemokama atvirojo kodo slaptažodžių tvarkyklė, kurią galima naudoti naršyklėje, kompiuteryje ir mobiliuosiuose telefonuose. <br><br>Nusprendėme prisidėti prie šio vertimo dėl programos kokybės ir kruopštumo, su kuriuo ji sukurta. Be to, ji yra atvirojo kodo ir nemokama! Ko dar galima norėti?",
    "authext_desc": "Tai patogus Firefox plėtinys, skirtas dviejų veiksnių autentifikavimo (2FA) kodams naršyklėje generuoti. Jis palaiko TOTP, HOTP ir net Steam Guard!<br><br> O kad būtų dar geriau, jis yra atvirojo kodo. Plėtinį bei jo kodą galite rasti <a href='https://authenticator.cc/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "jelu_desc":"Jelu yra atvirojo kodo, savarankiškai talpinama perskaitytų knygų sekimo priemonė! Ar kada nors norėjote turėti vieną vietą, kur galėtumėte stebėti savo skaitomų knygų progresą, išsaugoti savo įvertinimus, bei laikyti užrašus apie jas? Tuomet ši programėlė gali būti skirta jums! Išsamią dokumentaciją ir diegimo vadovą rasite <a href='https://bayang.github.io/jelu-web/' class='text-yellow-300 hover:underline'target='_blank'>čia</a>. <br><br>Jei norite prisidėti prie mūsų vertimo arba pridėti savo, projektą galite rasti <a href='https://crowdin.com/project/jelu' class='text-yellow-300 hover:underline'target='_blank'>čia</a>.",

    "about_who": "Kas mes?",
    "about_p": "Esame nedidelė technologijos entuziastų ir vertėjų bendruomenė iš Lietuvos, norinti išsaugoti savo kalbą internete. Mūsų laisvojo vertimo idėją įkvėpė <a href='https://en.wikipedia.org/wiki/Free_and_open-source_software' class='text-yellow-300 hover:underline' target='_blank'> FOSS judėjimas</a>. Kadangi programinė įranga gali būti atvirojo kodo, nusprendėme tą pačią idėją perkelti į kitą kiekvienos programos aspektą - lokalizavimą.",
    "about_why": "Kodėl ''kulviečiai''?",
    "about_abraomas": " Abraomas Kulvietis buvo vienas iš lietuvių raštijos ir vertimo pradininkų. Jis buvo XVI a. gimęs protestantas, atsakingas už įvairių lietuviškų mokyklų kūrimą ir reformacijos idėjų skleidimą. Žymiausias jo darbas - vienos pirmųjų lietuviškų psalmių sukūrimas. Tuo metu Lietuvos Didžiojoje Kunigaikštystėje buvo labai neišplėtota rašytinė kalba, todėl Abraomo darbai iki šiol laikomi labai svarbiais.",
    "about_abraomas_late": "Vėliau jis už religines pažiūras buvo ištremtas į Prūsiją, kur tapo Karaliaučiaus universiteto rektoriumi ir Prūsijos kunigaikščio patarėju. Prieš mirtį jam buvo leista grįžti į Lietuvą, kur jis toliau skleidė savo tautines ir protestantiškas idėjas. Mirė 1545 m. nuo džiovos, būdamas 35 metų amžiaus.",
    "about_abraomas_final": "Atsižvelgdami į jo svarbą lietuvių kultūroje ir tikėdamiesi tęsti jo idealus, nusprendėme pasivadinti pagal jo pavardę.",

    "contributions_title": "Mūsų prisidėjimai",
    "contributions_games": "Žaidimai",
    "contributions_software": "Programos",

    "404_title": "Puslapis, kurio ieškojote, nerastas!",
    "404_p": "Spauskite <a href='/' class='nav__link text-yellow-300 hover:underline' data-link>čia</a> kad grįžtumėte atgal. </p>",

    "index_welcome": "Sveiki!",
    "index_p": "Esame lietuvių vertėjų bendruomenė, siekianti, kad kuo daugiau žmonių galėtų naudotis programine įranga ir medija savo gimtąja kalba. Už vertimus nieko neimame ir galime versti iš anglų kalbos į lietuvių kalbą ir atvirkščiai.<br><br> Norite, kad jūsų programinė įranga, svetainė ar žaidimas būtų prieinamesni nemokamai? Susisiekite su mumis!<br><br> Jei domitės vertimo ar technologijos temomis, galite susipažinti su mūsų sukaupta patirtimi skyriuje ''Gidai''.",

    "crowdin_title": "Crowdin - pradėjimo instrukcija",
    "crowdin_subtitle": "Vertimas naudojant crowdin.com",
    "crowdin_intro": "Crowdin yra vienas populiariausių lokalizacijos valdymo įrankių, ir dėl geros priežasties! Naudojant šį įrankį, kiekvienas, nepriklausomai nuo patirties, gali prisidėti prie vertimų ir juos peržiūrėti. Nereikia jokių programavimo ar IT žinių, tik interneto ryšio ir suderinamos naršyklės. Pradėkime!<br><br> Reikalavimai:",
    "crowdin_requirements": "<li>Internetas</li> <li>Naršyklė (Chrome, Firefox, ir t.t.)</li>",
    "crowdin_start": "<br>Pirmiausia, eikite į <a href='https://crowdin.com/' class='text-yellow-300 hover:underline' target='_blank'>crowdin.com</a>. Čia mes užsiregistruosime. Spauskite 'Sign up': ",
    "crowdin_2nd": "<br>Užsiregistruokite naudodami jums priimtiniausią metodą. Galite susikurti atskirą paskyrą arba užsiregistruoti naudojant Google, GitHub ar kitas jau turimas paskyras.",
    "crowdin_3rd": "<br>Sėkmingai užsiregistravę būsite nukreipti į sukurtą profilį (būtinai patvirtinkite savo paskyrą, kad užtikrintumėte didesnį saugumą). Dabar eikite į Profile -> Explore Public Projects.",
    "crowdin_4th": "Jums bus parodyti įvairūs vieši projektai, kuriuos galima versti. Galite ieškoti konkretaus projekto arba naršyti pagal įvairias kategorijas. Demonstraciniais tikslais ieškosime Bitwarden projekto.",
    "crowdin_5th": "<br>Įvedus paiešką parodomi rezultatai. Jei nerandate to, ko ieškote, galite pabandyti pasinaudoti dešinėje esančiais filtrais ir susiaurinti paiešką. Pasirinkite projektą, kurį norite išversti.",
    "crowdin_6th": "<br>Pastaba: gali būti, kad jūsų ieškomas projektas yra privatus. Norėdami gauti prieigą prie tokio projekto, turėtumėte susisiekti su žmonėmis, atsakingais už to projekto lokalizavimą.",
    "crowdin_7th": "<br>Pasirinkite kalbą, prie kurios norite prisidėti. Jei jos nėra, kreipkitės į asmenis, atsakingus už lokalizavimą, esančius po programėlės aprašymu.",
    "crowdin_8th": "<br>Dabar jums bus parodyti visi į projektą įtraukti lokalizavimo failai ir kiek jų išversta. Galite pasirinkti konkretų failą arba spustelėti ''Versti visus''.",
    "crowdin_9th": "<br>Tai atidarys redaktorių. Iš pradžių jis gali pasirodyti painus, bet prie jo priprasti lengviau, nei atrodo.",
    "crowdin_10th": "<br>Viršuje matomas originalus tekstas, o apačioje yra laukas, kuriame įvedamas vertimas. Po juo galima matyti TM ir MT (mašininio vertimo) pasiūlymus, kurie gali padėti apytiksliai įsivaizduoti, koks galėtų būti vertimas. Dešinėje yra komentarai, kuriuos paprastai palieka kiti vertėjai. Kairėje pusėje yra sąrašas eilučių (sakinių ar žodžių), kurias reikia išversti.",
    "crowdin_11th": "<br>Pastaba: kartais kai kuriems žodžiams pateikiami kontekstai. Jie gali padėti geriau suprasti, ką žodis reiškia. Juos galite peržiūrėti užvesdami pelės žymeklį ant jų. Jie pabraukiami taip:",
    "crowdin_12th": "<br>Tokie pagrindai! Crowdin yra itin galinga ir paprasta naudoti platforma, o šiame gide tik apžvelgiamas jos paviršius. Jei norėtumėte sužinoti daugiau, pasidomėkite <a href='https://support.crowdin.com/crowdin-intro/' class='text-yellow-300 hover:underline' target='_blank'>oficialia Crowdin dokumentacija</a>. Joje gali būti to, ko jums reikia!<br><br>",

    "htb_htblabs_title": "HTB - HTBank Guide - Parameter Injection",
    "htb_htblabs_subtitle": "A guide to the 'HTBank (Easy)' challenge",
    "htb_htblabs_intro": "Author: nitrog<br><br>'HTBank' is an Easy marked challenge from HackTheBox. It is attributed to the 'Web' category. It involves having to discover a specific parameter, and then changing it using an attack referred to as 'Parameter Pollution'. Let's get started!<br><br> Requirements:",
    "htb_htblabs_requirements": "<li>Internet connection</li> <li>Burp Suite Community Edition</li> <li>A HackTheBox account with access to the lab</li>",
    "htb_htblabs_start": "First, we'll need to open up the link provided in Burp Suite. Open up the Proxy and turn off the interceptor so we could explore the site. Then we'll open up the browser:",
    "htb_htblabs_2nd": "We're presented with a login/register form. After trying to perform basic SQL injection in the login page, we can see that it doesn't take us anywhere. Let's just try registering for now.",
    "htb_htblabs_3rd": "We've registered! Now let's login using the same credentials.",
    "htb_htblabs_4th": "We're presented with a dashboard of sorts. Clicking 'Add Money' doesn't do anything. However, 'Withdraw Money' looks a lot more promising:",
    "htb_htblabs_5th": "Let's enter an arbitrary amount of numbers in each field, <b>turn on the intercept</b>, and then click 'Withdraw' to see what happens.",
    "htb_htblabs_6th": "We can see that the request has been captured. However, to do anything with it, we'll need to send it to Repeater (CTRL+R or Right Click -> Send to Repeater).",
    "htb_htblabs_7th": "Let's send the request. We'll see that whatever number we enter, even the one given to us as a clue in the description (1337), we still get the same result. Inputting text also doesn't get us any useful results.",
    "htb_htblabs_8th": "How about we instead inspect the zipped source code. After a bit of digging, we can find the configuration information for the database.",
    "htb_htblabs_9th": "This would normally be useful, however, for this instance, it is pretty much irrelevant. Let's continue on. 'WithdrawController.php' looks particularly interesting:",
    "htb_htblabs_10th": "After inspection, it seems that if the amount entered when withdrawing is equal to 1337, the show_flag parameter is changed in the database. This is very useful.",
    "htb_htblabs_11th": "But wait. Didn't we do that before and it returned the same result as with any <i>other</i> number? There must be something blocking us from doing this. Let's inspect 'routes.py':",
    "htb_htblabs_12th": "In the 'withdraw' function's 'try' block, we can see that there's an 'if' statement. It checks the users balance, and if it is below zero, it returns an error saying there's not enough credits. This applies to us, since we just created our account and our balance is empty.",
    "htb_htblabs_13th": "So this is the thing holding us back. If our balance wasn't 0, the request after would follow and our flag would presumably be displayed in the home page, as can be seen in the same file in a previous function:",
    "htb_htblabs_14th": "This is where parameter pollution comes in. By submitting the 'amount' parameter twice in the same request, first as 0, and then as 1337, we bypass the balance check, and the request containing the flag will be shown to us in the home page. Let's go back to Burp's Repeater:",
    "htb_htblabs_15th": "Let's copy the 'amount' parameter, change the first one to zero, and the second one to '1337'. And now we get this response:",
    "htb_htblabs_16th": "<i>Note: If you don't get this response, try first sending 1337 as the first 'amount' value, and <b>only then</b> change it to zero.</i>",
    "htb_htblabs_17th": "If we go back to the home page, the flag will be now displayed. Congratulations!",
    "htb_htblabs_18th": "If you want to read up on parameter pollution more, you can do so on <a href='https://portswigger.net/web-security/api-testing/server-side-parameter-pollution' class='text-yellow-300 hover:underline' target='_blank'>this excellently written PortSwigger article</a>.<br><br>"
}
