{
    "title": "kulviečiai",
    "subtitle": "savanorių vertėjų ir technologijos entuziastų bendruomenė.",
    "about": "Apie mus",
    "contributions": "Prisidėjimai",
    "guides": "Gidai",
    "contact": "Susisiekite!",
    "status": "Būsena - ",
    "done": "BAIGTA",
    "typegame": "Rūšis - Žaidimas",
    "devs": "Kūrėjai - ",
    "trans": "Vertėjai - ",
    "desc": "Aprašymas: ",
    "rhythm_desc": "Rhythm Quest - ambicingas klasikinis platformeris, kuriame daugiausia dėmesio skiriama puolimui, šokinėjimui ir judėjimui pagal... ritmą! Tai labai unikalus požiūris į kažką, ką tikriausiai visi jau esame bandę, todėl jei norite tai pamatyti patys, žaidimą ir jo demo versiją galite peržiūrėti <a href='https://rhythmquestgame.com/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Kūrėjas yra labai aktyvus ir draugiškas, todėl jei jums patiko žaidimas, būtinai jį palaikykite.<br><br> Vertimą, prie kurio galite prisidėti arba pridėti savo, rasite <a href='https://crowdin.com/project/rhythm-quest' class='text-yellow-300 hover:underline' target='_blank'> čia</a>.",
    "battlebit_desc": "BattleBit Remastered - masinė kelių žaidėjų internetinė pirmojo asmens šaudyklė, labiausiai žinoma dėl to, jog viename žemėlapyje gali vienu metu būti net iki 254 žmonių! Žaidimą labai įkvėpė Battlefield žaidimų serija. <br><br> Šį žaidimą pasirinkome savo pirmajam vertimo projektui dėl to, jog juose esame praleidę daugybę laiko ir tas akimirkas pamename iki šiol. Be to, jį sukūrė tik trys žmonės! Žaidimą galite peržiūrėti <a href='https://store.steampowered.com/app/671860/BattleBit_Remastered/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "melonracer_desc": "Tai smagus klasikinis Garry's Mod žaidimo režimas lietuvių kalba! Galite sukurti savo vertimą arba rasti mūsų <a href='https://crowdin.com/project/melonracer' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "typeapp": "Rūšis - Aplikacija",
    "resume_desc": "Kaip apibūdina kūrėjas, ''Reactive Resume yra nemokamas atvirojo kodo CV kūrėjas, kuris supaprastina CV kūrimo, atnaujinimo ir dalijimosi jais procesą.''<br><br>Taigi ši programa ne tik atvirojo kodo, bet ir pagreitina ko gero nuobodžiausią darbo paieškos dalį! Šį įrankį galite rasti, naudoti ir palaikyti <a href='https://rxresu.me/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Būtinai ją išbandykite!<br><br>Jei norite prisidėti prie mūsų vertimo arba pridėti savo, projektą galite rasti <a href='https://crowdin.com/project/reactive-resume' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "bitwarden_desc": "<span class='italic font-semibold'>Pastaba: mes NESAME vieninteliai kurie prisidėjo prie šio vertimo. Visus autorius galite rasti <a href='https://crowdin.com/project/bitwarden-desktop/lt' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.<br><br></span> <a href='https://bitwarden.com/' class='text-yellow-300 hover:underline' target='_blank'>Bitwarden</a> yra nemokama atvirojo kodo slaptažodžių tvarkyklė, kurią galima naudoti naršyklėje, kompiuteryje ir mobiliuosiuose telefonuose. <br><br>Nusprendėme prisidėti prie šio vertimo dėl programos kokybės ir kruopštumo, su kuriuo ji sukurta. Be to, ji yra atvirojo kodo ir nemokama! Ko dar galima norėti?",
    "authext_desc": "Tai patogus Firefox plėtinys, skirtas dviejų veiksnių autentifikavimo (2FA) kodams naršyklėje generuoti. Jis palaiko TOTP, HOTP ir net Steam Guard!<br><br> O kad būtų dar geriau, jis yra atvirojo kodo. Plėtinį bei jo kodą galite rasti <a href='https://authenticator.cc/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "jelu_desc":"Jelu yra atvirojo kodo, savarankiškai talpinama perskaitytų knygų sekimo priemonė! Ar kada nors norėjote turėti vieną vietą, kur galėtumėte stebėti savo skaitomų knygų progresą, išsaugoti savo įvertinimus, bei laikyti užrašus apie jas? Tuomet ši programėlė gali būti skirta jums! Išsamią dokumentaciją ir diegimo vadovą rasite <a href='https://bayang.github.io/jelu-web/' class='text-yellow-300 hover:underline'target='_blank'>čia</a>. <br><br>Jei norite prisidėti prie mūsų vertimo arba pridėti savo, projektą galite rasti <a href='https://crowdin.com/project/jelu' class='text-yellow-300 hover:underline'target='_blank'>čia</a>.",

    "about_who": "Kas mes?",
    "about_p": "Esame nedidelė technologijos entuziastų ir vertėjų bendruomenė iš Lietuvos, norinti išsaugoti savo kalbą internete. Mūsų laisvojo vertimo idėją įkvėpė <a href='https://en.wikipedia.org/wiki/Free_and_open-source_software' class='text-yellow-300 hover:underline' target='_blank'> FOSS judėjimas</a>. Kadangi programinė įranga gali būti atvirojo kodo, nusprendėme tą pačią idėją perkelti į kitą kiekvienos programos aspektą - lokalizavimą.",
    "about_why": "Kodėl ''kulviečiai''?",
    "about_abraomas": " Abraomas Kulvietis buvo vienas iš lietuvių raštijos ir vertimo pradininkų. Jis buvo XVI a. gimęs protestantas, atsakingas už įvairių lietuviškų mokyklų kūrimą ir reformacijos idėjų skleidimą. Žymiausias jo darbas - vienos pirmųjų lietuviškų psalmių sukūrimas. Tuo metu Lietuvos Didžiojoje Kunigaikštystėje buvo labai neišplėtota rašytinė kalba, todėl Abraomo darbai iki šiol laikomi labai svarbiais.",
    "about_abraomas_late": "Vėliau jis už religines pažiūras buvo ištremtas į Prūsiją, kur tapo Karaliaučiaus universiteto rektoriumi ir Prūsijos kunigaikščio patarėju. Prieš mirtį jam buvo leista grįžti į Lietuvą, kur jis toliau skleidė savo tautines ir protestantiškas idėjas. Mirė 1545 m. nuo džiovos, būdamas 35 metų amžiaus.",
    "about_abraomas_final": "Atsižvelgdami į jo svarbą lietuvių kultūroje ir tikėdamiesi tęsti jo idealus, nusprendėme pasivadinti pagal jo pavardę.",

    "contributions_title": "Mūsų prisidėjimai",
    "contributions_games": "Žaidimai",
    "contributions_software": "Programos",

    "404_title": "Puslapis, kurio ieškojote, nerastas!",
    "404_p": "Spauskite <a href='/' class='nav__link text-yellow-300 hover:underline' data-link>čia</a> kad grįžtumėte atgal. </p>",

    "index_welcome": "Sveiki!",
    "index_p": "Esame lietuvių vertėjų bendruomenė, siekianti, kad kuo daugiau žmonių galėtų naudotis programine įranga ir medija savo gimtąja kalba. Už vertimus nieko neimame ir galime versti iš anglų kalbos į lietuvių kalbą ir atvirkščiai.<br><br> Norite, kad jūsų programinė įranga, svetainė ar žaidimas būtų prieinamesni nemokamai? Susisiekite su mumis!<br><br> Jei domitės vertimo ar technologijos temomis, galite susipažinti su mūsų sukaupta patirtimi skyriuje ''Gidai''.",

    "crowdin_title": "Crowdin - pradžios instrukcija",
    "crowdin_subtitle": "Vertimas naudojant crowdin.com",
    "crowdin_intro": "Autorius: nitrog<br><br>Crowdin yra vienas populiariausių lokalizacijos valdymo įrankių, ir dėl geros priežasties! Naudojant šį įrankį, kiekvienas, nepriklausomai nuo patirties, gali prisidėti prie vertimų ir juos peržiūrėti. Nereikia jokių programavimo ar IT žinių, tik interneto ryšio ir suderinamos naršyklės. Pradėkime!<br><br> Reikalavimai:",
    "crowdin_requirements": "<li>Internetas</li> <li>Naršyklė (Chrome, Firefox, ir t.t.)</li>",
    "crowdin_start": "<br>Pirmiausia, eikite į <a href='https://crowdin.com/' class='text-yellow-300 hover:underline' target='_blank'>crowdin.com</a>. Čia mes užsiregistruosime. Spauskite 'Sign up': ",
    "crowdin_2nd": "<br>Užsiregistruokite naudodami jums priimtiniausią metodą. Galite susikurti atskirą paskyrą arba užsiregistruoti naudojant Google, GitHub ar kitas jau turimas paskyras.",
    "crowdin_3rd": "<br>Sėkmingai užsiregistravę būsite nukreipti į sukurtą profilį (būtinai patvirtinkite savo paskyrą, kad užtikrintumėte didesnį saugumą). Dabar eikite į Profile -> Explore Public Projects.",
    "crowdin_4th": "Jums bus parodyti įvairūs vieši projektai, kuriuos galima versti. Galite ieškoti konkretaus projekto arba naršyti pagal įvairias kategorijas. Demonstraciniais tikslais ieškosime Bitwarden projekto.",
    "crowdin_5th": "<br>Įvedus paiešką parodomi rezultatai. Jei nerandate to, ko ieškote, galite pabandyti pasinaudoti dešinėje esančiais filtrais ir susiaurinti paiešką. Pasirinkite projektą, kurį norite išversti.",
    "crowdin_6th": "<br>Pastaba: gali būti, kad jūsų ieškomas projektas yra privatus. Norėdami gauti prieigą prie tokio projekto, turėtumėte susisiekti su žmonėmis, atsakingais už to projekto lokalizavimą.",
    "crowdin_7th": "<br>Pasirinkite kalbą, prie kurios norite prisidėti. Jei jos nėra, kreipkitės į asmenis, atsakingus už lokalizavimą, esančius po programėlės aprašymu.",
    "crowdin_8th": "<br>Dabar jums bus parodyti visi į projektą įtraukti lokalizavimo failai ir kiek jų išversta. Galite pasirinkti konkretų failą arba spustelėti ''Versti visus''.",
    "crowdin_9th": "<br>Tai atidarys redaktorių. Iš pradžių jis gali pasirodyti painus, bet prie jo priprasti lengviau, nei atrodo.",
    "crowdin_10th": "<br>Viršuje matomas originalus tekstas, o apačioje yra laukas, kuriame įvedamas vertimas. Po juo galima matyti TM ir MT (mašininio vertimo) pasiūlymus, kurie gali padėti apytiksliai įsivaizduoti, koks galėtų būti vertimas. Dešinėje yra komentarai, kuriuos paprastai palieka kiti vertėjai. Kairėje pusėje yra sąrašas eilučių (sakinių ar žodžių), kurias reikia išversti.",
    "crowdin_11th": "<br>Pastaba: kartais kai kuriems žodžiams pateikiami kontekstai. Jie gali padėti geriau suprasti, ką žodis reiškia. Juos galite peržiūrėti užvesdami pelės žymeklį ant jų. Jie pabraukiami taip:",
    "crowdin_12th": "<br>Tokie pagrindai! Crowdin yra itin galinga ir paprasta naudoti platforma, o šiame gide tik apžvelgiamas jos paviršius. Jei norėtumėte sužinoti daugiau, pasidomėkite <a href='https://support.crowdin.com/crowdin-intro/' class='text-yellow-300 hover:underline' target='_blank'>oficialia Crowdin dokumentacija</a>. Joje gali būti to, ko jums reikia!<br><br>",

    "htb_htblabs_title": "HTB - HTBank aprašas - Parametrų injekcija",
    "htb_htblabs_subtitle": "Instrukcija, skirta 'HTBank (Easy)' iššūkiui",
    "htb_htblabs_intro": "Autorius: nitrog<br><br>'HTBank' yra lengvo sunkumo iššūkis iš HackTheBox. Jis yra priskirtas 'Web' kategorijai. Jame reikia atrasti tam tikrą parametrą ir jį pakeisti naudojant 'Parameter injection' ataką. Pradėkim!<br><br> Reikalavimai:",
    "htb_htblabs_requirements": "<li>Interneto ryšys</li> <li>Burp Suite Community Edition</li> <li>HackTheBox paskyra su prieiga prie užduoties</li>",
    "htb_htblabs_start": "Pirmiausia turėsime atidaryti pateiktą nuorodą naudojant Burp Suite įrankį. Atidarykite 'Proxy' ir išjunkite 'interceptor', kad galėtume ištirti svetainę. Tada atidarysime naršyklę:",
    "htb_htblabs_2nd": "Pateikiama prisijungimo/registracijos forma. Pabandę atlikti paprastą SQL injekciją prisijungimo puslapyje, matome, kad ji niekur neveda. Kol kas pabandykim užsiregistruoti.",
    "htb_htblabs_3rd": "Užsiregistravom! Dabar prisijunkite naudodami tuos pačius prisijungimo duomenis.",
    "htb_htblabs_4th": "Mums pateikiamas tam tikras dashboard'as. Paspaudus 'Add Money' niekas neįvyksta. Tačiau 'Withdraw Money' atrodo daug įdomiau:",
    "htb_htblabs_5th": "Į kiekvieną laukelį įveskime bet kokią skaičių sumą, <b>įjunkite 'intercept'</b> ir spauskite 'Withdraw':",
    "htb_htblabs_6th": "Matome, kad užklausa pagauta. Tačiau, norėdami ką nors su ja padaryti, turėsime ją nusiųsti į 'Repeater' (CTRL+R arba dešinysis pelės mygtukas -> Siųsti į 'Repeater').",
    "htb_htblabs_7th": "Išsiųskime užklausą. Pamatysime, kad ir kokį numerį įvestume, net ir tą, kuris buvo nurodytas kaip užuomina aprašyme (1337), vis tiek gausime tą patį rezultatą. Įvesdami tekstą taip pat negauname jokių naudingų rezultatų.",
    "htb_htblabs_8th": "Pažiūrėkim į mums duotą 'source code'. Šiek tiek pasikapstę galime rasti duomenų bazės konfigūracijos informaciją.",
    "htb_htblabs_9th": "Įprastai tai būtų naudinga, tačiau šiuo atveju tai praktiškai nesvarbu. Tęskime toliau. 'WithdrawController.php' atrodo ypač įdomiai:",
    "htb_htblabs_10th": "Atrodo, kad jei išėmimo metu įvesta suma yra lygi 1337, duomenų bazėje pasikeičia parametras 'show_flag'. Tai galimai naudinga.",
    "htb_htblabs_11th": "Bet argi to nedarėme anksčiau ir negavome tokio paties rezultato, kaip ir su bet kuriuo kitu skaičiumi? Tikriausiai kažkas egzistuoja, kas mums trukdo tai padaryti. Peržiūrėkim 'routes.py':",
    "htb_htblabs_12th": "Funkcijos 'withdraw' 'try' bloke matom, kad yra 'if' teiginys. Ji tikrina naudotojo balansą ir, jei jis yra mažesnis už nulį, grąžinama klaida, kad nėra pakankamai kreditų. Tai taikoma mums, nes ką tik sukūrėme savo paskyrą ir mūsų balansas yra tuščias.",
    "htb_htblabs_13th": "Taigi tai mus ir stabdo. Jei mūsų likutis nebūtų 0, užklausa po to sektų ir mūsų vėliava tikriausiai būtų parodoma pagrindiniame puslapyje, kaip matoma tame pačiame faile ankstesnėje funkcijoje:",
    "htb_htblabs_14th": "Būtent čia atsiranda 'parameter pollution'. Du kartus pateikdami parametrą 'amount' toje pačioje užklausoje, iš pradžių kaip 0, o paskui kaip 1337, apeisime balanso patikrinimą ir užklausa su ieškoma vėliava bus rodoma pagrindiniame puslapyje. Grįžkim prie Burp Repeater:",
    "htb_htblabs_15th": "Nukopijuokim parametrą 'amount', pirmąjį parametrą pakeiskime į nulį, o antrąjį - į '1337'. Dabar gausime tokį atsakymą:",
    "htb_htblabs_16th": "<i>Pastaba: Jei tokio atsakymo negaunate, pirmiausia pabandykite siųsti 1337 kaip pirmąją 'amount' reikšmę ir <b>tik tada</b> pakeiskite ją į nulį.</i>",
    "htb_htblabs_17th": "Jei grįšim į pagrindinį puslapį, vėliava bus rodoma. Pavyko!",
    "htb_htblabs_18th": "Jei norite daugiau sužinoti apie 'parameter pollution' atakas, galite tai padaryti <a href='https://portswigger.net/web-security/api-testing/server-side-parameter-pollution' class='text-yellow-300 hover:underline' target='_blank'>šiame puikiai parašytame PortSwigger straipsnyje (anglų kalba)</a>.<br><br>",

    "htb_0xchunked_title": "HTB - 0xBOverchunked aprašas",
    "htb_0xchunked_subtitle": "Instrukcija, skirta '0xBOverchunked (Easy)' iššūkiui",
    "htb_0xchunked_intro": "Autorius: nitrog<br><br>0xBOverchunked yra lengvo sunkumo HTB iššūkis, susijęs su žiniatinklio programų išnaudojimu.<br><br> Reikalavimai:",
    "htb_0xchunked_requirements": "<li>Interneto ryšys</li> <li>SQLMap įrankis</li> <li>Burp Suite Community Edition</li> <li>HackTheBox paskyra su prieiga prie užduoties</li>",
    "htb_0xchunked_start": "Pirmiausia turėsime atidaryti pateiktą nuorodą naudojant Burp Suite įrankį. Atidarykite 'Proxy' ir išjunkite 'interceptor', kad galėtume ištirti svetainę. Tada atidarysime naršyklę:",
    "htb_0xchunked_2nd": "Šioje užduotyje reikia rasti šeštąją duomenų bazėje išsaugotą reikšmę. Pabandykime ieškoti naudodami pateiktą įvesties lauką:",
    "htb_0xchunked_3rd": "Atrodo, kad mums neleidžiama peržiūrėti šeštojo įrašo. Pabandykime atlikti paprastą SQL injekcijos ataką.",
    "htb_0xchunked_4th": "Matome, kad yra WAF (žiniatinklio programos ugniasienė) ir ji neleidžia mums atlikti injekcijos. Tikriausiai yra programinis filtras, kuris tikrina, ar nėra įtartinų simbolių. Patikrinkime 'source code':",
    "htb_0xchunked_5th": "Atrodo, kad mūsų įtarimai buvo teisingi, nes 'waf.php' faile matome filtrą. Atrodo, kad turėsime sugalvoti kokį nors kitą būdą, kaip gauti vėliavą. Tęskime 'source code' analizę.",
    "htb_0xchunked_6th": "'Database' aplanke esančiam 'cursor.php' faile galime rasti kodą, neleidžiantį mums peržiūrėti šeštojo įrašo, ir užuominą. Matome, kad yra du galimi duomenų bazės užklausų tipai: 'safequery' ir 'unsafequery'. Pabandykime rasti, kaip sukelti šį 'unsafequery'.",
    "htb_0xchunked_7th": "Išnagrinėję 'SearchHandler.php' failą matome, kad jei HTTP perdavimas yra suskaidytas į dalis (angl. 'chunked'), paleidžiama nesaugi užklausa, kuri leis mums ieškoti šeštojo įrašo.",
    "htb_0xchunked_8th": "Pasak <a href='https://developer.mozilla.org/en-US/docs/Web/HTTP/Range_requests#comparison_to_chunked_transfer-encoding' class='text-yellow-300 hover:underline' target='_blank'>Mozilos dokumentaciją</a>, 'chunked' perdavimo kodavimas dažnai naudojamas, kai klientui siunčiami didesni duomenų kiekiai, neperkeliant atsakymo į buferį ir nenustatant tikslaus užklausos ilgio. Dėl to pagerėja užklausos greitis. 'Chunked' kodavimas dažnai naudojamas didelėms duomenų bazių užklausoms (pvz., HTML lentelei užpildyti) arba perduodant didelius vaizdus.",
    "htb_0xchunked_9th": "Kibernetinio saugumo kontekste suskaidytos užklausos gali būti naudojamos tam tikriems SQL injekcijos apribojimams apeiti. Paprastai į juodąjį sąrašą (angl. 'blacklist') įtrauktus SQL raktinius žodžius galima padalinti į dalis, todėl juose esanti užklausa gali būti priimta. Pavyzdžiui, įrankyje 'SQLMap' yra script'as, kuriame naudojamas šis metodas, naudojant parametrą '--chunked'.",
    "htb_0xchunked_10th": "Tačiau, kadangi per URL adresą nepateikiami jokie kintamieji, turime užfiksuoti pačią užklausą. Tam atlikti įjungsime 'intercept' Burp įrankyje ir pateiksime paieškos formą. Turėtumėte matyti, kad užklausa pasirodo jūsų 'Burp Proxy':",
    "htb_0xchunked_11th": "Dabar viską nukopijuokite, sukurkite teksto failą ir įklijuokite į jį užklausą. Būtinai išsaugokite failą ir prisiminkite, kur jis yra.",
    "htb_0xchunked_12th": "Dabar perduokime užklausą SQLMap, naudodami šiuos parametrus:",
    "htb_0xchunked_13th": "Štai ką daro kiekvienas parametras:<br><br><li>-r - nurodo išsaugotos užklausos vietą, kurią SQLMap panaudos atakai vykdyti.</li> <li>--chunked - nurodo SQLMap naudoti 'chunked' kodavimą, kurį aptarėme anksčiau.</li> <li>--dump - atvaizduoja duomenų bazės lentelės įrašus. </li> <li>--time-sec=2 - šis parametras nurodo SQLMap laukti atsakymo iki 2 sekundžių. Numatytoji reikšmė yra 5, todėl tai pagreitina procesą.</li> <li>--threads - šis parametras nurodo SQLMap naudoti tam tikrą CPU gijų skaičių. Tai pagreitina injekcijos procesą ir leidžia greičiau gauti rezultatus. Gijų kiekis, kurį galite naudoti, priklauso nuo jūsų sistemos.</li>",
    "htb_0xchunked_14th": "Jei proceso metu bus pateiktas koks nors pasirinkimas - rinkitės numatytą. Po kurio laiko turėtumėt pamatyti vėliavą:",
    "htb_0xchunked_15th": "Sveikinam, pabaigėt užduotį! <br><br>"
}