{
    "title": "kulviečiai",
    "subtitle": "savanorių vertėjų bendruomenė.",
    "about": "Apie mus",
    "contributions": "Prisidėjimai",
    "guides": "Gidai",
    "contact": "Susisiek!",
    "status": "Būsena - ",
    "done": "BAIGTA",
    "typegame": "Rūšis - Žaidimas",
    "devs": "Kūrėjai - ",
    "trans": "Vertėjai - ",
    "desc": "Aprašymas: ",
    "rhythm_desc": "Rhythm Quest - ambicingas klasikinis platformeris, kuriame daugiausia dėmesio skiriama puolimui, šokinėjimui ir judėjimui pagal... ritmą! Tai labai unikalus požiūris į kažką, ką tikriausiai visi jau esame bandę, todėl jei norite tai pamatyti patys, žaidimą ir jo demo versiją galite peržiūrėti <a href='https://rhythmquestgame.com/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Kūrėjas yra labai aktyvus ir draugiškas, todėl jei jums patiko žaidimas, būtinai jį palaikykite.<br><br> Vertimą, prie kurio galite prisidėti arba pridėti savo, rasite <a href='https://crowdin.com/project/rhythm-quest' class='text-yellow-300 hover:underline' target='_blank'> čia</a>.",
    "battlebit_desc": "BattleBit Remastered - masinė kelių žaidėjų internetinė pirmojo asmens šaudyklė, labiausiai žinoma dėl to, jog viename žemėlapyje gali vienu metu būti net iki 254 žmonių! Žaidimą labai įkvėpė Battlefield žaidimų serija. <br><br> Šį žaidimą pasirinkome savo pirmajam vertimo projektui dėl to, jog juose esame praleidę daugybę laiko ir tas akimirkas pamename iki šiol. Be to, jį sukūrė tik trys žmonės! Žaidimą galite peržiūrėti <a href='https://store.steampowered.com/app/671860/BattleBit_Remastered/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "melonracer_desc": "Tai smagus klasikinis Garry's Mod žaidimo režimas lietuvių kalba! Galite sukurti savo vertimą arba rasti mūsų <a href='https://crowdin.com/project/melonracer' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "typeapp": "Rūšis - Aplikacija",
    "resume_desc": "Kaip apibūdina kūrėjas, ''Reactive Resume yra nemokamas atvirojo kodo CV kūrėjas, kuris supaprastina CV kūrimo, atnaujinimo ir dalijimosi jais procesą.''<br><br>Taigi ši programa ne tik atvirojo kodo, bet ir pagreitina ko gero nuobodžiausią darbo paieškos dalį! Šį įrankį galite rasti, naudoti ir palaikyti <a href='https://rxresu.me/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>. Būtinai ją išbandykite!<br><br>Jei norite prisidėti prie mūsų vertimo arba pridėti savo, projektą galite rasti <a href='https://crowdin.com/project/reactive-resume' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    "bitwarden_desc": "<span class='italic font-semibold'>Pastaba: mes NESAME vieninteliai kurie prisidėjo prie šio vertimo. Visus autorius galite rasti <a href='https://crowdin.com/project/bitwarden-desktop/lt' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.<br><br></span> <a href='https://bitwarden.com/' class='text-yellow-300 hover:underline' target='_blank'>Bitwarden</a> yra nemokama atvirojo kodo slaptažodžių tvarkyklė, kurią galima naudoti naršyklėje, kompiuteryje ir mobiliuosiuose telefonuose. <br><br>Nusprendėme prisidėti prie šio vertimo dėl programos kokybės ir kruopštumo, su kuriuo ji sukurta. Be to, ji yra atvirojo kodo ir nemokama! Ko dar galima norėti?",
    "authext_desc": "Tai patogus Firefox plėtinys, skirtas dviejų veiksnių autentifikavimo (2FA) kodams naršyklėje generuoti. Jis palaiko TOTP, HOTP ir net Steam Guard!<br><br> O kad būtų dar geriau, jis yra atvirojo kodo. Plėtinį bei jo kodą galite rasti <a href='https://authenticator.cc/' class='text-yellow-300 hover:underline' target='_blank'>čia</a>.",
    
    "about_who": "Who are we?",
    "about_p": "We are a relatively small community of tech enthusiasts and translators from Lithuania who wish to preserve our language. Our idea of free translation was inspired by the <a href='https://en.wikipedia.org/wiki/Free_and_open-source_software' class='text-yellow-300 hover:underline' target='_blank'> FOSS movement</a>. Since software can be open-source, we decided to bring that same idea to another aspect of every program – localization.",
    "about_why": "Why 'Kulvians'?",
    "about_abraomas": "Abraomas Kulvietis was one of the fathers of Lithuanian writing and translation. He was a protestant born in the XVI century, responsible for creating various Lithuanian schools and spreading ideas of reformation. His most renowned work is creating one of the first Lithuanian psalms. At the time, the Grand Duchy of Lithuania had a very undeveloped written language, which is why the work of Abraomas is considered very important to this day.",
    "about_abraomas_late": "He was exiled to Prussia for his religious views later on in life, where he became the rector of Karaliaučius University and the Duke of Prussia’s advisor. Before his death he was allowed to return to Lithuania, where he continued the spread of his national and protestant ideas. He passed away in 1545 from consumption at 35 years of age.",
    "about_abraomas_final": "Because of his importance in Lithuanian culture and our hope of continuing his ideals, we decided to name ourselves after his last name.",

    "contributions_title": "Our contributions",
    "contributions_games":"Games",
    "contributions_software":"Software",

    "404_title": "The page you're looking for wasn't found!",
    "404_p": "Click <a href='/' class='nav__link text-yellow-300 hover:underline' data-link>here</a> to go back.</p>",

    "index_welcome": "Welcome!",
    "index_p": "We are a Lithuanian translating community that’s dedicated to ensuring as many people as possible can enjoy software and media in their own language, and all for free.<br><br> We don’t charge anything for our translations, and we are able to translate from English to Lithuanian and vice versa. Want your software, website, or game to be more available, for free? Contact us!<br><br> If you’re curious about translation or other topics, you can check our compiled experience in the “Guides” section.",

    "crowdin_title": "Crowdin - setup guide",
    "crowdin_subtitle": "Translation using crowdin.com",
    "crowdin_intro": "Crowdin is one of the most popular localization management tools out there, and for good reason! It allows practically anyone, regardless of their experience, to contribute to and review translations. It doesn’t require any programming or IT knowledge, just an internet connection and compatible browser. Let’s get started!<br><br> Requirements:",
    "crowdin_requirements": "<li>Internet connection</li> <li>Web browser (Chrome, Firefox, etc.)</li>",
    "crowdin_start": "<br>To start with, go to <a href='https://crowdin.com/' class='text-yellow-300 hover:underline' target='_blank'>crowdin.com</a>. This is where we’ll register. Click 'Sign up'",
    "crowdin_2nd": "<br>Sign up using the method you prefer the most. You can either create a separate account, or register using something like Google or GitHub.",
    "crowdin_3rd": "<br>Once successfully registered, you’ll be redirected to your new profile (make sure to verify your account to ensure better security). Now, navigate to Profile -> Explore Public Projects.",
    "crowdin_4th": "You’ll be shown a variety of public projects available for translation. You can either search for a specific one, or browse using categories. For demo purposes, we’ll be searching for “Bitwarden”.",
    "crowdin_5th": "<br>And we get shown the results. If you can’t find what you’re looking for, you can try using the filters located to the right to narrow down your search. Select the project you’d like to translate.",
    "crowdin_6th": "<br>Note: It’s also possible that the project you’re looking for is private. To access such projects, you should contact the people responsible for said project’s localization.",
    "crowdin_7th": "<br>Select the language you’d like to contribute to. If it doesn’t exist, contact the localization managers located below the app’s description.",
    "crowdin_8th": "<br>Now you’ll be shown all of the localization files included in the project, together with how much they’ve been translated. You can either choose a specific file, or click “Translate All”.",
    "crowdin_9th": "<br>This opens the editor. It may appear overwhelming at first, but you’ll get used to it!",
    "crowdin_10th": "<br>Above, you can see the original text, and below is the field where you type in your translation. Below it, you can see TM and MT (Machine Translation) suggestions, which can help you get a rough idea of what the translation might be. To the right are comments, which are usually left by other translators. To the left is a list of strings (sentences or words) that need to be translated.",
    "crowdin_11th": "<br>Note: Sometimes, there are also contexts given for some words. They can get you a better idea of what the word actually means. You can view them by hovering over them. They are underlined like this:",
    "crowdin_12th": "<br>That covers the basics! Crowdin is an extremely powerful and easy platform to use, and this guide only scratches the surface. If you’d like to learn more, refer to the official <a href='https://support.crowdin.com/crowdin-intro/' class='text-yellow-300 hover:underline' target='_blank'>Crowdin documentation</a>. It might contain the details you need!<br><br>"
}
